weatheri = ['가평', '강화', '고양', '과천', '광명', '광주', '구리', '군포', '김포', '남양주', '동두천', '백령도', '부천', '서울', '성남', '수원', '시흥', '안산', '안성', '안양',
            '양주', '양평', '여주', '연천', '오산', '용인', '의왕', '의정부', '이천', '인천', '파주', '평택', '포천', '하남', '화성', '양구', '영월', '원주', '인제', '정선',
            '철원', '춘천', '평창', '홍천', '화천', '횡성', '강릉', '고성', '대관령', '동해', '삼척', '속초', '양양', '태백', '괴산', '단양', '보은', '영동', '옥천', '음성',
            '제천', '증평', '진천', '청주', '추풍령', '충주', '계룡', '공주', '금산', '논산', '당진', '대전', '보령', '부여', '서산', '서천', '세종', '아산', '예산', '천안',
            '청양', '태안', '홍성', '고창', '군산', '김제', '남원', '무주', '부안', '순창', '완주', '익산', '임실', '장수', '전주', '정읍', '진안', '강진', '고흥', '곡성',
            '광양', '광주', '구례', '나주', '담양', '목포', '무안', '보성', '순천', '신안', '여수', '영광', '영암', '완도', '장성', '장흥', '진도', '함평', '해남', '화순',
            '흑산도', '경산', '경주', '고령', '구미', '군위', '김천', '달성', '대구', '문경', '봉화', '상주', '성주', '안동', '영덕', '영양', '영주', '영천', '예천', '울진',
            '의성', '청도', '청송', '칠곡', '포항', '거제', '거창', '고성', '김해', '남해', '밀양', '부산', '사천', '산청', '양산', '울산', '의령', '진주', '창녕', '창원',
            '통영', '하동', '함안', '함양', '합천', '고산', '서귀포', '성산포', '성판악', '제주', '독도', '울릉도']
donnae = ['수원시장안구', '성남시수정구', '의정부시', '안양시만안구', '부천시', '광명시', '평택시', '동두천시', '안산시상록구', '안산시단원구', '고양시덕양구', '과천시', '구리시',
          '남양주시', '오산시', '시흥시','군포시','의왕시','하남시','용인시처인구','파주시','이천시','안성시','김포시',
          '화성시','광주시','양주시','포천시','여주시','연천군','가평군','양평군']
# donnae2 = ['수원시장안구','성남시수정구','의정부시','안양시만안구','부천시','광명시','평택시','동두천시','안산시상록구','안산시단원구','고양시덕양구','과천시','구리시','남양주시','오산시','시흥시','군포시','의왕시','하남시','용인시처인구','파주시','이천시','안성시','김포시','화성시','광주시','양주시','포천시','여주시','연천군','가평군','양평군']
bin = []

# for i in weatheri:
#     if i in donnae:
#         bin.append(i)
# print(bin)

for i in weatheri:
    for j in donnae:
        if i in j:
            print(j)

